Revit 2026 API

# BuiltInFailuresPointFailures Class

---

Failures about Point Element.

SystemObject Autodesk.Revit.DBBuiltInFailuresPointFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PointFailures
```
```vb
Public NotInheritable Class PointFailures
```
```cpp
public ref class PointFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointFailures = class end
```

The BuiltInFailuresPointFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotMakePointHostedByIntersection | Cannot make point hosted by intersection. |
|  | CantChangeParamFlip | Can't flip Element. |
|  | CantChangeParamMirror | Can't mirror Element. |
|  | CantChangeParamRotate | Can't rotate Element. |
|  | EdgeHostedPointToBeUnhosted | A point element in a family was hosted on an edge outside its family and the edge no longer exists. The point will remain placed but with no host. |
|  | HostMeasurementError | Invalid host curve measurement type or value or justification |
|  | HostParameterRangeError | Hosted Parameter must be between 0 and 1 |
|  | RegenFailure | Regeneration Failure. |

#### Reference

Autodesk.Revit.DB Namespace